tap "homebrew/cask"
cask_args appdir: "~/Applications", require_sha: true

# Utilities
brew "cmake"
brew "wget"
brew "exa"
brew "git"
brew "jq"
brew "pre-commit"
brew "neofetch"
brew "ripgrep"
brew "tree"
brew "git-delta"
brew "fzf"
brew "bat"
brew "tmux"
brew "k6"
brew "coreutils"
brew "fd"
brew "poppler"
brew "ffmpegthumbnailer"
brew "mediainfo"
brew "imagemagick"

cask "microsoft-edge"
cask "raycast", args: { require_sha: false }
cask "obsidian"
cask "clipy"
cask "snipaste"
cask "bartender"
cask "iterm2"
cask "kitty"
cask "amethyst"

# Programming languages
brew "pyenv"
brew "nvm"
brew "pipenv"
brew "go"

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-fira-code"
cask "font-cascadia-mono"
cask "font-cascadia-code"
cask "font-hack-nerd-font"

# DevOps tools
tap "hashicorp/tap"
brew "terraform"
brew "packer"

tap "mutagen-io/mutagen"
brew "mutagen"
brew "mutagen-compose"

cask "lens"
cask "tableplus"
cask "google-cloud-sdk", args: { require_sha: false }
cask "docker"

brew "awscli"
brew "helm"
brew "skaffold"
brew "minikube"
brew "k3d"
brew "kubecm"
brew "hadolint"
brew "terraform-docs"

# Editors
cask "visual-studio-code"

tap "d12frosted/emacs-plus"
brew "emacs-plus@29", args: ["with-imagemagick", "with-xwidgets", "with-poll", "with-native-comp", "with-savchenkovaleriy-big-sur-icon"]

brew "neovim"

# Language servers
brew "rust-analyzer"
brew "hashicorp/tap/terraform-ls"
brew "typescript-language-server"

