# cask_args appdir: "~/Applications", require_sha: true

# Utilities
brew "cmake"
brew "bison"
brew "wget"
brew "eza"
brew "git"
brew "jq"
brew "pre-commit"
brew "fastfetch"
brew "ripgrep"
brew "tree"
brew "git-delta"
brew "fzf"
brew "bat"
brew "tmux"
brew "zellij"
brew "k6"
brew "htop"
brew "btop"
brew "pandoc"
brew "coreutils"
brew "fd"
brew "poppler"
brew "ffmpegthumbnailer"
brew "mediainfo"
brew "imagemagick"
brew "zoxide"
brew "neovim"
brew "watch"
brew "lazygit"
brew "just"

tap "sst/tap"
brew "opencode"

# Apps
cask "karabiner-elements"
cask "raycast", args: { require_sha: false }
cask "obsidian"
cask "snipaste"
cask "jordanbaird-ice@beta"
cask "kitty"
cask "ghostty"
cask "amethyst"
cask "brave-browser"
cask "zed

# Programming languages
brew "pyenv"
# brew "nvm"
# brew "pipenv"
brew "go"
tap "oven-sh/bun"
brew "bun"
brew "zig"
brew "luarocks"
brew "mise"

# Fonts
# tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-fira-code"
cask "font-cascadia-mono"
cask "font-cascadia-code"
cask "font-hack-nerd-font"
cask "font-noto-sans-cjk", args: { require_sha: false }
cask "font-iosevka"
cask "font-google-sans-code"

# DevOps tools
tap "hashicorp/tap"
brew "terraform"
# brew "packer"
cask "lens"
cask "tableplus"
cask "gcloud-cli", args: { require_sha: false }
cask "orbstack"

brew "awscli"
brew "helm"
brew "kubecm"
brew "hadolint"
brew "terraform-docs"
brew "krew"
brew "caddy"

# Language servers
brew "rust-analyzer"
brew "hashicorp/tap/terraform-ls"
brew "typescript-language-server"

# Editors/IDE
# cask "visual-studio-code"

# tap "d12frosted/emacs-plus"
# brew "emacs-plus@29", args: ["with-imagemagick", "with-xwidgets", "with-poll", "with-native-comp", "with-savchenkovaleriy-big-sur-icon"]
