brew "neovim"
brew "exa"
brew "git"
brew "awscli"
brew "jq"
brew "nvm"
brew "pipenv"
brew "go"
brew "pre-commit"
brew "terraform-docs"
brew "neofetch"
brew "k6"
brew "ripgrep"
brew "minikube"
brew "tree"
brew "git-delta"
brew "fzf"
brew "helm"
brew "bat"
brew "skaffold"

# casks
tap "homebrew/cask"
cask_args appdir: "~/Applications", require_sha: true

cask "visual-studio-code"
cask "microsoft-edge"
cask "raycast", args: { require_sha: false }
cask "obsidian"
cask "emacs"
cask "clipy"
cask "snipaste"
cask "tableplus"
cask "google-cloud-sdk", args: { require_sha: false }
cask "docker"
cask "bartender"
cask "iterm2"
cask "kitty"
cask "amethyst"

tap "hashicorp/tap"
brew "terraform"
brew "packer"

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-fira-code"
cask "font-cascadia-mono"
cask "font-cascadia-code"
cask "font-hack-nerd-font"

tap "mutagen-io/mutagen"
brew "mutagen"

